# pas=input('Введите Пароль : ')
# dlina = 8
# if pas.isdigit() and len(pas) >= dlina:
#     print('Ваш пароль сохранен')
# elif len(pas) < dlina:
#     print('Ваш пароль должен содержать не менее 8 символов')
# elif pas != pas.isalnum() :
#     print('Введите Только Цифры')
# else:
#     print('ERROR')

# # numbers=input("Введите Отценки Ученика :")
# # ball = 68
# # number1 = numbers.split(',')
# # math_ = numbers[0]+numbers[1]
# # eng = numbers[2]+numbers[3]
# # print(eng)
# # lit = numbers[6]+numbers[7]
# # int(lit)
# # result = (int(math_) + int(eng) + int(lit))/3 
# # if result>= 68:
# #     print("1")
# # else:
# #     print("0")
# # print(result)




# # import random
# # game = ['камень' , 'ножницы' , 'бумага']
# # a = random.choice(game)
# # b = input("Ввод : камень , ножницы , бумага \n Ваш Выбор: ")
# # if a[0] == b[0]:
# #     print(f'Вы Выйграли \n Ваш Ответ :{b}\n Ответ Бота :{a}')
# # else:
# #     print(f'Вы Проиграли :( \n Ваш Ответ :{b} \n Ответ Бота :{a}')

# print(f"I like brand {}")





# Напишите программу, которая просит пользователя ввести свой юзернейм (одним словом) и генерирует пароль из юзернейма, добавив в конец строки символ $, в середину символ &, и заменив строчные буквы на заглавные и наоборот.



# username = input('Введите Свой Ник: ')
# center= len(username) //2

# '*'.join(str)


# group.py


positive = 1
negative = -2

print(f'{positive} Positive')
print(f'{negative} Negative')