# Git - система контоля версий 
# github онлайн сервис который предоствляет услуги для хранение ваших проектов

# git init- интцализация проект (проверка и сохраняет )
# git remote and origin url - добавляет удаленный репоциторий котррый находится на каком нибудь сервере 

# git pull origin master(назывние ветки) - стягиваем изменение с ветки 
# git status - показывает статус
# git add - добавляет файлы в рабочей папке в индекс(индекс в git - это спецальный промежутачная облость в котором хранится измениене файлов от рабочей директории до уделаннего репозитории )
# git add file_name file2_name - доавляет какой то файл
# git add . - добавляет все файлы
# git commit - доавбялет все файлы которые находится в идексе 
# git commit -n 'название коментария ' - коментарий для вашего сохранение 
# git branch = показывает списки веток 
# git branch - name_branch (git brach lol) создает новую ветку 
# git checkout name_brach - переключение веток
# git push name_brach - за отпаврку кода в удаленный репозитрий
# git push origin master
# git reset file_name - удаляет файл из индекса 
# git rm (-r папка) --cached name  - перестает слаедить за ним 
# git branch -D name -удаление ветки
# git merge lol  - сляние веток
# git log - список коммитов
# git push --force origin
# git reset [commit/tag] - отменить все коммиты  после указанного коммита (изменения будут сохранение локально)
